benchmark_results.txt
1. Статика через nginx
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.24.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /sample.html
Document Length:        1048576 bytes

Concurrency Level:      10
Time taken for tests:   1.915 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1048897000 bytes
HTML transferred:       1048576000 bytes
Requests per second:    522.14 [#/sec] (mean)
Time per request:       19.152 [ms] (mean)
Time per request:       1.915 [ms] (mean, across all concurrent requests)
Transfer rate:          534831.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     0   19   8.0     18     118
Waiting:        0    4   6.7      3     103
Total:          0   19   8.1     18     118

Percentage of the requests served within a certain time (ms)
  50%     18
  66%     18
  75%     19
  80%     19
  90%     21
  95%     33
  98%     40
  99%     59
 100%    118 (longest request)
----------------------------------
2. Статика через gunicorn
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8081

Document Path:          /sample.html
Document Length:        1048576 bytes

Concurrency Level:      10
Time taken for tests:   2.807 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1048719000 bytes
HTML transferred:       1048576000 bytes
Requests per second:    356.21 [#/sec] (mean)
Time per request:       28.073 [ms] (mean)
Time per request:       2.807 [ms] (mean, across all concurrent requests)
Transfer rate:          364812.65 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     7   28   2.2     27      37
Waiting:        7   28   2.2     27      37
Total:          7   28   2.2     27      37

Percentage of the requests served within a certain time (ms)
  50%     27
  66%     28
  75%     28
  80%     29
  90%     30
  95%     32
  98%     33
  99%     36
 100%     37 (longest request)
----------------------------------
3. Динамика через gunicorn
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8081

Document Path:          /
Document Length:        16 bytes

Concurrency Level:      10
Time taken for tests:   0.055 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      135000 bytes
HTML transferred:       16000 bytes
Requests per second:    18342.23 [#/sec] (mean)
Time per request:       0.545 [ms] (mean)
Time per request:       0.055 [ms] (mean, across all concurrent requests)
Transfer rate:          2418.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    1   0.3      0       3
Waiting:        0    0   0.3      0       2
Total:          0    1   0.3      0       3
ERROR: The median and mean for the processing time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the total time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      1
  80%      1
  90%      1
  95%      1
  98%      2
  99%      2
 100%      3 (longest request)
----------------------------------
4. Динамика через nginx
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.24.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        16 bytes

Concurrency Level:      10
Time taken for tests:   0.057 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      168001 bytes
HTML transferred:       16000 bytes
Requests per second:    17607.49 [#/sec] (mean)
Time per request:       0.568 [ms] (mean)
Time per request:       0.057 [ms] (mean, across all concurrent requests)
Transfer rate:          2888.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    0   0.8      0      25
Waiting:        0    0   0.8      0      25
Total:          0    0   0.8      0      25

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      1
  98%      1
  99%      1
 100%     25 (longest request)
----------------------------------
5. Динамика через nginx из кэша
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.24.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        16 bytes

Concurrency Level:      10
Time taken for tests:   0.032 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      168000 bytes
HTML transferred:       16000 bytes
Requests per second:    31325.38 [#/sec] (mean)
Time per request:       0.319 [ms] (mean)
Time per request:       0.032 [ms] (mean, across all concurrent requests)
Transfer rate:          5139.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    0   0.2      0       2
Waiting:        0    0   0.1      0       2
Total:          0    0   0.2      0       2

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      1
  98%      1
  99%      1
 100%      2 (longest request)